{"pages":[],"posts":[{"title":"First Night","text":"你好世界","link":"/2018/11/12/FirstNight/"},{"title":"建博客时遇到的错误","text":"号称五分中搭建起博客的教程，无奈搭建了一天。但是如过顺利的话，五分中搭建也不是不可能。遇到了有关git还有markdown的知识，在此出第一篇笔记 [https://blog.csdn.net/qq_34047841/article/details/60129781][五分钟搭建博客] 1.在pull提交时遇到了，提交密码的问题，涉及git公私钥配置 加密传输的算法有好多，git可使用rsa，rsa要解决的一个核心问题是，如何使用一对特定的数字，使其中一个数字可以用来加密，而另外一个数字可以用来解密。这两个数字就是你在使用git和github的时候所遇到的public key也就是公钥以及private key私钥。 其中，公钥就是那个用来加密的数字，这也就是为什么你在本机生成了公钥之后，要上传到github的原因。从github发回来的，用那公钥加密过的数据，可以用你本地的私钥来还原。配置公私钥流程在此 ##然而公钥配置成功后依旧没解决 2.git clone下载方法https用443端口，可以对repo根据权限进行读写，只要有账号密码就可进行操作。ssh则用的是22端口，也可以对repo根据权限进行读写，但是需要SSH Keys授权，这个key是通过ssh key生成器生成的，然后放在github上，作为授权的证据，这样的话就不需要用户名和密码进行授权了。 所以，一开始时没有注意，现在每次push都需要密码登录。解决方法就是到git config里面更改回来。而且在博客的——config.yaml文件夹下也需要修改，因为没有这个考虑，致使走了很多弯路。1git@github.com:Sheldongg/Sheldongg.github.io.git配置文件有不同需要注意因为改初改到22端口进行ssh认证爆出12alert(&apos;ssh: connect to host github.com port 22: Connection timed outfatal: Could not read from remote repository.’） 输入ssh -T -p 22 git@ssh.github.com解决问题，在提示下就可以 Permanently added ‘ssh.github.com,192.30.253.123’ (RSA) to the list of known hosts.","link":"/2018/10/30/建博客时遇到的错误/"},{"title":"网页","text":"网页三要素： 1.描述网页结构的html 2.描述网页样式的CSS 3.描述网页行为的语言，控制网站的效果，和前后端的数据交互 辨别静态网页和动态网页 辨别：网页 URL的后缀不是htm、html、shtml、xml等静态网页的常见形式，而是以·aspx、.asp、.jsp、.php、.perl、.cgi等形式为后缀，并且在动态网页网址中有一个标志性的符号“?”。 静态网页与动态的区别 ： 程序是否在服务器端运行，是重要标志。在服务器端运行的程序、网页、组件，属于动态网页，它们会随不同客户、不同时间，返回不同的网页，例如ASP、PHP、JSP、ASP.net、CGI等。运行于客户端的程序、网页、插件、组件，属于静态网页，例如html页、Flash、javascript、VBscript等等，它们是永远不变的。 静态网页和动态网页各有特点，网站采用动态网页还是静态网页主要取决于网站的功能需求和网站内容的多少，如果网站功能比较简单，内容更新量不是很大，采用纯静态网页的方式会更简单，反之一般要采用动态网页技术来实现。 动态网页的特征 (1)动态网页一般以数据库技术为基础，可以大大降低网站维护的工作量； (2)采用动态网页技术的网站可以实现更多的功能，如用户注册、用户登录、在线调查、用户管理、订单管理等等； (3)动态网页实际上并不是独立存在于服务器上的网页文件，只有当用户请求时服务器才返回一个完整的网页； (4)动态网页中的“?”对搜索引擎检索存在一定的问题，搜索引擎一般不可能从一个网站的数据库中访问全部网 页，或者出于技术方面的考虑，搜索之中不去抓取网址中“?”后面的内容，因此采用动态网页的网站在进行搜索引擎推 广时需要做一定的技术处理才能适应搜索引擎的要求。 动态网页缺点11首先动态网页在访问速度上不占优势 动态网页首先获得用户的指令，然后网页拿着指令到数据库中找和指令相对应的数据，然后传递给服务器，通过服务器的编译把动态页面编译成标准的HTML代码，传递给用户浏览器，这样用户就看到了网页。问题出来了，每次访问网页都要经过这么一个过程，这一过程至少需要几秒钟的时间，访问的人数一多，页面的加载速度就会变慢，对服务器来说也是一种负担；从用户角度来说，网页加载的慢，迟迟没有反应，下次谁还会来访问你的网站。而静态网页就简单了，静态网页是实际存在的，无需经过服务器的编译，直接加载到客户浏览器上显示出来。由此可见，动态网页在访问速度上并不占优势。 2在搜索引擎收录方面并不占优势 上面从服务器和用户体验的角度说了一下，下面再从搜索引擎收录角度说一下，动态网页是在用户输入指令后才形成的页面，并不存在这个页面，而搜索引擎只会抓取现成的，并不会自己输入，因此网站在搜索引擎收录方面并不占优势。搜索引擎还是喜欢静态页面。不过搜索引擎在不断完善发展。到目前为止，绝大多数的搜索引擎都已支持动态页面的抓取。","link":"/2018/11/12/网页/"}],"tags":[{"name":"js","slug":"js","link":"/tags/js/"},{"name":"知识内参","slug":"知识内参","link":"/tags/知识内参/"},{"name":"web","slug":"web","link":"/tags/web/"},{"name":"git","slug":"git","link":"/tags/git/"},{"name":"blog","slug":"blog","link":"/tags/blog/"}],"categories":[{"name":"前端","slug":"前端","link":"/categories/前端/"},{"name":"思想","slug":"思想","link":"/categories/思想/"},{"name":"小试身手","slug":"小试身手","link":"/categories/小试身手/"}]}